{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "source": [
    "filename = \"ABOX.ttl\"\r\n",
    "\r\n",
    "\r\n",
    "import rdflib\r\n",
    "import rdfextras\r\n",
    "rdfextras.registerplugins() # so we can Graph.query()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "source": [
    "text1 = '''CQ2.1: Retrieve all simulations along with their sources.\r\n",
    "'''\r\n",
    "\r\n",
    "query1 = '''\r\n",
    "PREFIX ex: <https://example.org/> \r\n",
    "PREFIX sim: <https://w3id.org/simulation/ontology/> \r\n",
    "\r\n",
    "SELECT * WHERE {\r\n",
    "?simulation sim:hasSource ?source .\r\n",
    "}\r\n",
    "'''\r\n",
    "\r\n",
    "text2 = '''CQ2.2: What are the simulations and respective reality counterparts that have the same simulacrum but a different source?'''\r\n",
    "\r\n",
    "query2 = '''\r\n",
    "PREFIX ex: <https://example.org/> \r\n",
    "PREFIX sim: <https://w3id.org/simulation/ontology/> \r\n",
    "\r\n",
    "SELECT distinct ?simulation ?rc ?source WHERE {\r\n",
    "?simulation1 sim:hasSimulacrum ?simulacrum ;\r\n",
    "             sim:hasSource ?source1 .\r\n",
    "?simulation2 sim:hasSimulacrum ?simulacrum ;\r\n",
    "             sim:hasSource ?source2 .\r\n",
    "filter (?simulation1 != ?simulation2 && ?source1 != ?source2) .\r\n",
    "?simulacrum sim:isSimulacrumOf ?simulation .\r\n",
    "?simulation sim:hasRealityCounterpart ?rc ;\r\n",
    "            sim:hasSource ?source .\r\n",
    "}\r\n",
    "'''\r\n",
    "\r\n",
    "text3 = '''CQ2.3: What are the reality counterparts of the simulations with rose as a\r\n",
    "simulacrum or its variants? '''\r\n",
    "\r\n",
    "query3 = '''\r\n",
    "PREFIX ex: <https://example.org/> \r\n",
    "PREFIX sim: <https://w3id.org/simulation/ontology/> \r\n",
    "\r\n",
    "SELECT distinct ?simulation\r\n",
    "where {{\r\n",
    "ex:rose sim:isSimulacrumOf ?simulation .} UNION {ex:rose sim:hasVariant ?variant.\r\n",
    "?variant sim:isSimulacrumOf ?simulation}\r\n",
    "} '''\r\n",
    "\r\n",
    "text4 ='''CQ2.4: What are the variants of man?'''\r\n",
    "\r\n",
    "query4 ='''\r\n",
    "PREFIX ex: <https://example.org/> \r\n",
    "PREFIX sim: <https://w3id.org/simulation/ontology/>  \r\n",
    "\r\n",
    "SELECT distinct ?variant\r\n",
    "where {\r\n",
    "ex:man sim:hasVariant ?variant .\r\n",
    "}\r\n",
    "'''\r\n",
    "\r\n",
    "text5 ='''CQ2.5: What are the contexts of the simulations listed in dictionaryOfSymbols1?'''\r\n",
    "\r\n",
    "query5 = '''\r\n",
    "PREFIX ex: <https://example.org/> \r\n",
    "PREFIX sim: <https://w3id.org/simulation/ontology/>  \r\n",
    "\r\n",
    "SELECT distinct ?context where {\r\n",
    "?simulation sim:hasSource ex:dictionaryOfSymbols1 ;\r\n",
    "            sim:hasContext ?context\r\n",
    "}\r\n",
    "'''\r\n",
    "\r\n",
    "text6 = '''CQ2.6: Are there simulations that do not have a source?'''\r\n",
    "\r\n",
    "query6 = '''\r\n",
    "PREFIX ex: <https://example.org/> \r\n",
    "PREFIX sim: <https://w3id.org/simulation/ontology/>  \r\n",
    "\r\n",
    "ASK {\r\n",
    "?simulation a sim:Simulation .\r\n",
    "MINUS {?simulation sim:hasSource ?source}\r\n",
    "}\r\n",
    "'''\r\n",
    "\r\n",
    "queries = [(text1, query1),(text2, query2),(text3, query3),(text4, query4),(text5, query5),(text6, query6)]"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "source": [
    "g=rdflib.ConjunctiveGraph()\r\n",
    "g.parse(filename, format=\"turtle\")\r\n",
    "for query in queries:\r\n",
    "    results = g.query(query[1])\r\n",
    "    print(query[0])\r\n",
    "    for row in results:\r\n",
    "        print(row)"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "CQ2.1: Retrieve all simulations along with their sources.\n",
      "\n",
      "(rdflib.term.URIRef('https://example.org/ashTree-odin'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "(rdflib.term.URIRef('https://example.org/ashTree-connection'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "(rdflib.term.URIRef('https://example.org/ashTree-surrender'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "(rdflib.term.URIRef('https://example.org/olive-immortality'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "(rdflib.term.URIRef('https://example.org/olive-fertility'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/rose-love'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/rose-beauty'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/damaskRose-freshness'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/giant-manBeforeTheFall'), rdflib.term.URIRef('https://example.org/literarySource1'))\n",
      "(rdflib.term.URIRef('https://example.org/man-fire'), rdflib.term.URIRef('https://example.org/literarySource1'))\n",
      "CQ2.2: Retrieve all the simulations and respective reality counterparts and sources that have the same simulacrum but a different source.\n",
      "(rdflib.term.URIRef('https://example.org/olive-fertility'), rdflib.term.URIRef('https://example.org/fertility'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/olive-immortality'), rdflib.term.URIRef('https://example.org/immortality'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "CQ2.3: Retrieve all the simulations that have rose as a simulacrum along with the simulations of the variants of rose. \n",
      "(rdflib.term.URIRef('https://example.org/rose-beauty'),)\n",
      "(rdflib.term.URIRef('https://example.org/rose-love'),)\n",
      "(rdflib.term.URIRef('https://example.org/damaskRose-freshness'),)\n",
      "CQ2.4: Retrieve all the variants of man.\n",
      "(rdflib.term.URIRef('https://example.org/manBeforeTheFall'),)\n",
      "CQ2.5: Retrieve all the contexts of the simulations listed in dictionaryofsymbols1.\n",
      "(rdflib.term.URIRef('https://example.org/norse'),)\n",
      "(rdflib.term.URIRef('https://example.org/celtic'),)\n",
      "(rdflib.term.URIRef('https://example.org/generalOrUnknown'),)\n",
      "CQ2.6: Retrieve all the simulations without a source.\n"
     ]
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [],
   "outputs": [],
   "metadata": {}
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}