{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c5a6510b",
   "metadata": {},
   "outputs": [],
   "source": [
    "filename = \"ABOX.ttl\"\n",
    "\n",
    "\n",
    "import rdflib\n",
    "import rdfextras\n",
    "rdfextras.registerplugins() # so we can Graph.query()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "35403aba",
   "metadata": {},
   "outputs": [],
   "source": [
    "text1 = '''CQ2.1: Retrieve all simulations along with their sources.\n",
    "'''\n",
    "\n",
    "query1 = '''\n",
    "PREFIX ex: <https://example.org/> \n",
    "PREFIX sim: <http://www.semanticweb.org/bruno/ontologies/2021/3/simulationontology#> \n",
    "\n",
    "SELECT * WHERE {\n",
    "?simulation sim:hasSource ?source .\n",
    "}\n",
    "'''\n",
    "\n",
    "text2 = '''CQ2.2: Retrieve all the simulations and respective reality counterparts and sources that have the same simulacrum but a different source.'''\n",
    "\n",
    "query2 = '''\n",
    "PREFIX ex: <https://example.org/> \n",
    "PREFIX sim: <http://www.semanticweb.org/bruno/ontologies/2021/3/simulationontology#> \n",
    "\n",
    "SELECT distinct ?simulation ?rc ?source WHERE {\n",
    "?simulation1 sim:hasSimulacrum ?simulacrum ;\n",
    "             sim:hasSource ?source1 .\n",
    "?simulation2 sim:hasSimulacrum ?simulacrum ;\n",
    "             sim:hasSource ?source2 .\n",
    "filter (?simulation1 != ?simulation2 && ?source1 != ?source2) .\n",
    "?simulacrum sim:isSimulacrumOf ?simulation .\n",
    "?simulation sim:hasRealityCounterpart ?rc ;\n",
    "            sim:hasSource ?source .\n",
    "}\n",
    "'''\n",
    "\n",
    "text3 = '''CQ2.3: Retrieve all the simulations that have rose as a simulacrum along with the simulations of the variants of rose. '''\n",
    "\n",
    "query3 = '''\n",
    "PREFIX ex: <https://example.org/> \n",
    "PREFIX sim: <http://www.semanticweb.org/bruno/ontologies/2021/3/simulationontology#> \n",
    "\n",
    "SELECT distinct ?simulation\n",
    "where {{\n",
    "ex:rose sim:isSimulacrumOf ?simulation .} UNION {ex:rose sim:hasVariant ?variant.\n",
    "?variant sim:isSimulacrumOf ?simulation}\n",
    "} '''\n",
    "\n",
    "text4 ='''CQ2.4: Retrieve all the variants of man.'''\n",
    "\n",
    "query4 ='''\n",
    "PREFIX ex: <https://example.org/> \n",
    "PREFIX sim: <http://www.semanticweb.org/bruno/ontologies/2021/3/simulationontology#>  \n",
    "\n",
    "SELECT distinct ?variant\n",
    "where {\n",
    "ex:man sim:hasVariant ?variant .\n",
    "}\n",
    "'''\n",
    "\n",
    "text5 ='''CQ2.5: Retrieve all the contexts of the simulations listed in dictionaryofsymbols1.'''\n",
    "\n",
    "query5 = '''\n",
    "PREFIX ex: <https://example.org/> \n",
    "PREFIX sim: <http://www.semanticweb.org/bruno/ontologies/2021/3/simulationontology#>  \n",
    "\n",
    "SELECT distinct ?context where {\n",
    "?simulation sim:hasSource ex:dictionaryOfSymbols1 ;\n",
    "            sim:hasContext ?context\n",
    "}\n",
    "'''\n",
    "\n",
    "text6 = '''CQ2.6: Retrieve all the simulations without a source.'''\n",
    "\n",
    "query6 = '''\n",
    "PREFIX ex: <https://example.org/> \n",
    "PREFIX sim: <http://www.semanticweb.org/bruno/ontologies/2021/3/simulationontology#>  \n",
    "\n",
    "SELECT distinct ?rc ?context where {\n",
    "?simulation a sim:Simulation .\n",
    "MINUS {?simulation sim:hasSource ?source}\n",
    "}\n",
    "'''\n",
    "\n",
    "queries = [(text1, query1),(text2, query2),(text3, query3),(text4, query4),(text5, query5),(text6, query6)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "dcd6ad1b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CQ2.1: Retrieve all simulations along with their sources.\n",
      "\n",
      "(rdflib.term.URIRef('https://example.org/ashTree-odin'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "(rdflib.term.URIRef('https://example.org/ashTree-connection'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "(rdflib.term.URIRef('https://example.org/ashTree-surrender'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "(rdflib.term.URIRef('https://example.org/olive-immortality'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "(rdflib.term.URIRef('https://example.org/olive-fertility'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/rose-love'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/rose-beauty'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/damaskRose-freshness'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/giant-manBeforeTheFall'), rdflib.term.URIRef('https://example.org/literarySource1'))\n",
      "(rdflib.term.URIRef('https://example.org/man-fire'), rdflib.term.URIRef('https://example.org/literarySource1'))\n",
      "CQ2.2: Retrieve all the simulations and respective reality counterparts and sources that have the same simulacrum but a different source.\n",
      "(rdflib.term.URIRef('https://example.org/olive-fertility'), rdflib.term.URIRef('https://example.org/fertility'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols2'))\n",
      "(rdflib.term.URIRef('https://example.org/olive-immortality'), rdflib.term.URIRef('https://example.org/immortality'), rdflib.term.URIRef('https://example.org/dictionaryOfSymbols1'))\n",
      "CQ2.3: Retrieve all the simulations that have rose as a simulacrum along with the simulations of the variants of rose. \n",
      "(rdflib.term.URIRef('https://example.org/rose-beauty'),)\n",
      "(rdflib.term.URIRef('https://example.org/rose-love'),)\n",
      "(rdflib.term.URIRef('https://example.org/damaskRose-freshness'),)\n",
      "CQ2.4: Retrieve all the variants of man.\n",
      "(rdflib.term.URIRef('https://example.org/manBeforeTheFall'),)\n",
      "CQ2.5: Retrieve all the contexts of the simulations listed in dictionaryofsymbols1.\n",
      "(rdflib.term.URIRef('https://example.org/norse'),)\n",
      "(rdflib.term.URIRef('https://example.org/celtic'),)\n",
      "(rdflib.term.URIRef('https://example.org/generalOrUnknown'),)\n",
      "CQ2.6: Retrieve all the simulations without a source.\n"
     ]
    }
   ],
   "source": [
    "g=rdflib.ConjunctiveGraph()\n",
    "g.parse(filename, format=\"turtle\")\n",
    "for query in queries:\n",
    "    results = g.query(query[1])\n",
    "    print(query[0])\n",
    "    for row in results:\n",
    "        print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c663182e",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
